//  ██████╗  █████╗ ███╗   ███╗███╗   ███╗ █████╗  
//  ██╔════╝ ██╔══██╗████╗ ████║████╗ ████║██╔══██╗
//  ██║  ███╗███████║██╔████╔██║██╔████╔██║███████║
//  ██║   ██║██╔══██║██║╚██╔╝██║██║╚██╔╝██║██╔══██║
//  ╚██████╔╝██║  ██║██║ ╚═╝ ██║██║ ╚═╝ ██║██║  ██║
//   ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝
//
// ================================================================================
// Реализация библиотеки stb_image.
// Мы определяем макрос STB_IMAGE_IMPLEMENTATION только в этом файле, 
// чтобы избежать ошибок множественного определения символов линковщиком.
// ================================================================================

#define STB_IMAGE_IMPLEMENTATION
#include "stb_image.h"

// Экспортируем скрытую функцию ZLib для использования в BwPackedSection.cpp
// Это позволяет не подключать отдельную библиотеку zlib.
extern "C" char* stbi_zlib_decode_malloc(const char* buffer, int len, int* outlen);